##  Terraform Plan — DEV Environment
| Step | Result |
|------|--------|
| Format | `success` |
| Validate | `success` |
| Plan | `success` |

<details><summary>Show Plan Output</summary>

```
Acquiring state lock. This may take a few moments...
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-02d15fcaa99aada0d]
module.eks.data.aws_iam_policy_document.eks_cluster_assume_role_policy: Read complete after 0s [id=3552664922]
module.bastion.data.aws_ami.ubuntu: Reading...
module.eks.aws_cloudwatch_log_group.eks_cluster_logs: Refreshing state... [id=/aws/eks/mlops-infr-dev-eks/cluster]
module.eks.data.aws_iam_policy_document.eks_node_assume_role_policy: Read complete after 0s [id=2851119427]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=mlops-infr-dev-eks-cluster-role]
module.eks.aws_iam_role.worker_nodes_role: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role]
module.eks.aws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260303181627321900000001]
module.eks.aws_iam_role_policy_attachment.eks_vpc_resource_controller: Refreshing state... [id=mlops-infr-dev-eks-cluster-role-20260303181627383300000002]
module.eks.aws_iam_role_policy_attachment.worker_nodes_cni_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260303181627712100000003]
module.eks.aws_iam_role_policy_attachment.worker_nodes_registry_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260303181627712600000004]
module.eks.aws_iam_role_policy_attachment.worker_nodes_policy: Refreshing state... [id=mlops-infr-dev-eks-worker-nodes-role-20260303181628067100000005]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-1]
module.bastion.data.aws_ami.ubuntu: Read complete after 2s [id=ami-0c1d28734eb221b6d]
module.vpc.aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-026a3b06654c18419]
module.vpc.aws_subnet.private_subnet["1"]: Refreshing state... [id=subnet-07bb1f8ab585ef90c]
module.vpc.aws_subnet.public_subnet["1"]: Refreshing state... [id=subnet-0e4fe0f87bcf077bd]
module.vpc.aws_subnet.public_subnet["0"]: Refreshing state... [id=subnet-000f346eedf442497]
module.vpc.aws_subnet.private_subnet["0"]: Refreshing state... [id=subnet-0233338d1e3185d55]
module.bastion.aws_security_group.allow_ssh: Refreshing state... [id=sg-0a2dea392481ca359]
module.security_group.aws_security_group.eks_control_plane: Refreshing state... [id=sg-077ccc0914f6ff811]
module.security_group.aws_security_group.eks_worker_nodes: Refreshing state... [id=sg-0d7ef37710d9d8f06]
module.vpc.aws_route_table.public_route_table: Refreshing state... [id=rtb-0568fcff7af3f1512]
module.vpc.aws_eip.eip_nat["0"]: Refreshing state... [id=eipalloc-09ac658248194f808]
module.vpc.aws_eip.eip_nat["1"]: Refreshing state... [id=eipalloc-07130b3df2317cae3]
module.bastion.aws_instance.bastion_host: Refreshing state... [id=i-01f0908ec72c5586f]
module.eks.aws_eks_cluster.main: Refreshing state... [id=mlops-infr-dev-eks]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-065afd68d04d5ffd3]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-0e1195021f6d797c9]
module.security_group.aws_security_group_rule.control_plane_to_nodes_kubelet: Refreshing state... [id=sgrule-142255494]
module.security_group.aws_security_group_rule.control_plane_to_nodes_https: Refreshing state... [id=sgrule-306891872]
module.security_group.aws_security_group_rule.nodes_to_control_plane_https: Refreshing state... [id=sgrule-318599478]
module.eks.aws_launch_template.eks_nodes: Refreshing state... [id=lt-070923cfd01c52adf]
module.vpc.aws_nat_gateway.nat_gateway["1"]: Refreshing state... [id=nat-0f30a669b18af461b]
module.vpc.aws_nat_gateway.nat_gateway["0"]: Refreshing state... [id=nat-0fc11116439535195]
module.vpc.aws_route_table.private_route_table["0"]: Refreshing state... [id=rtb-031e42be8f78fb63b]
module.vpc.aws_route_table.private_route_table["1"]: Refreshing state... [id=rtb-085c04218554e3a7c]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-0ca64c3f32cef0444]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-0ae54c8ca9b35a3cf]
module.eks.aws_eks_node_group.main: Refreshing state... [id=mlops-infr-dev-eks:mlops-infr-dev-eks-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.bastion.aws_instance.bastion_host must be replaced
-/+ resource "aws_instance" "bastion_host" {
      ~ ami                                  = "ami-031f713803bf2f9f2" -> "ami-0c1d28734eb221b6d" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:255315173346:instance/i-01f0908ec72c5586f" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-01f0908ec72c5586f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-032f77da0cedd52c9" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-28.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.28" -> (known after apply)
      ~ public_dns                           = "ec2-54-169-217-92.ap-southeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.169.217.92" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "KLTN-Bastion-Host"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058cd86ea2a38ddd0" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.security_group.aws_security_group_rule.control_plane_to_nodes_https will be created
  + resource "aws_security_group_rule" "control_plane_to_nodes_https" {
      + description              = "HTTPS from EKS control plane (webhook aggregation)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0d7ef37710d9d8f06"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-077ccc0914f6ff811"
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.control_plane_to_nodes_kubelet will be created
  + resource "aws_security_group_rule" "control_plane_to_nodes_kubelet" {
      + description              = "Kubelet API - from EKS control plane"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0d7ef37710d9d8f06"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-077ccc0914f6ff811"
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.security_group.aws_security_group_rule.nodes_to_control_plane_https will be created
  + resource "aws_security_group_rule" "nodes_to_control_plane_https" {
      + description              = "Kubernetes API - HTTPS from worker nodes"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-077ccc0914f6ff811"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0d7ef37710d9d8f06"
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ bastion_host_public_ip              = "54.169.217.92" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>

>*Commit: `2caaf49c44b58c092072f29f0e27259ba40611bc`*